# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_주문체결_00:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '9201': '계좌번호', '9203': '주문번호', '9205': '관리자사번',
            '9001': '종목코드',
            '912':  '주문업무분류', '913': '주문상태',
            '302':  '종목명',
            '900':  '주문수량', '901': '주문가격', '902': '미체결수량', '903': '체결누계금액', '904': '원주문번호', '905': '주문구분',
            '906':  '매매구분', '907': '매도수구분', '908': '주문체결시간', '909': '체결번호', '910': '체결가', '911': '체결량',
            '10':   '현재가', '27': '최우선매도호가', '28': '최우선매수호가',
            '914':  '단위체결가', '915': '단위체결량',
            '938':  '당일매매수수료', '939': '당일매매세금',
            '919':  '거부사유', '920': '화면번호', '921': '터미널번호', '922': '신용구분', '923': '대출일',
            '10010': '시간외단일가현재가',
            '2134': '거래소구분', '2135': '거래소구분명', '2136': 'SOR여부'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}
        self.dic_매도수구분 = {
            '1': '매도', '2': '매수'
        }
        self.dic_거래소구분 = {
            '0': '통합', '1': 'KRX', '2': 'NXT'
        }


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_잔고_04:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '9201': '계좌번호', '9001': '종목코드',
            '917': '신용구분', '916': '대출일', '302': '종목명',
            '10': '현재가', '930': '보유수량', '931': '매입단가', '932': '총매입가당일누적', '933': '주문가능수량', '945': '당일순매수량',
            '946': '매도매수구분',' 950': '당일총매도손익', '951': 'ExtraItem1',
            '27': '최우선매도호가', '28': '최우선매수호가', '307': '기준가', '8019': '손익률실현손익',
            '957': '신용금액', '958': '신용이자', '918': '만기일',
            '990': '당일실현손익유가', '991': '당일실현손익율유가', '992': '당일실현손익신용', '993': '당일실현손익율신용',
            '959': '담보대출수량', '924': 'ExtraItem2'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_주식기세_0A:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '10': '현재가', '11': '전일대비', '12': '등락율', '27': '최우선매도호가', '28': '최우선매수호가',
            '13': '누적거래량', '14': '누적거래대금', '16': '시가', '17': '고가', '18': '저가',
            '25': '전일대비기호', '26': '전일거래량대비', '29': '거래대금증감', '30': '전일거래량대비비율', '31': '거래회전율', '32': '거래비용',
            '311': '시가총액억', '567': '상한가발생시간', '568': '하한가발생시간'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_주식체결_0B:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '20': '체결시간', '10': '현재가', '11': '전일대비', '12': '등락율', '27': '최우선매도호가', '28': '최우선매수호가',
            '15': '거래량', '13': '누적거래량', '14': '누적거래대금', '16': '시가', '17': '고가', '18': '저가',
            '25': '전일대비기호', '26': '전일거래량대비', '29': '거래대금증감', '30': '전일거래량대비비율', '31': '거래회전율', '32': '거래비용',
            '228': '체결강도', '311': '시가총액억', '290': '장구분',
            '691': 'KO접근도', '567': '상한가발생시간', '568': '하한가발생시간', '851': '전일동시간거래량비율',
            '1890': '시가시간', '1891': '고가시간', '1892': '저가시간',
            '1030': '매도체결량', '1031': '매수체결량', '1032': '매수비율', '1071': '매도체결건수', '1072': '매수체결건수',
            '1313': '순간거래대금', '1315': '매도체결량단건', '1316': '매수체결량단건', '1314': '순매수체결량',
            '1497': 'CFD증거금', '1498': '유지증거금',
            '620': '당일거래평균가', '732': 'CFD거래비용', '852': '대주거래비용', '9081': '거래소구분'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}
        self.dic_장구분 = {
            '1': '장전시간외', '2': '장중', '3': '장후시간외'
        }


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_주식우선호가_0C:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '27': '최우선매도호가', '28': '최우선매수호가'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_주식호가잔량_0D:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '21': '호가시간',
            '41': '매도호가1', '61': '매도호가수량1', '81': '매도호가직전대비1', '51': '매수호가1', '71': '매수호가수량1', '91': '매수호가직전대비1',
            '42': '매도호가2', '62': '매도호가수량2', '82': '매도호가직전대비2', '52': '매수호가2', '72': '매수호가수량2', '92': '매수호가직전대비2',
            '43': '매도호가3', '63': '매도호가수량3', '83': '매도호가직전대비3', '53': '매수호가3', '73': '매수호가수량3', '93': '매수호가직전대비3',
            '44': '매도호가4', '64': '매도호가수량4', '84': '매도호가직전대비4', '54': '매수호가4', '74': '매수호가수량4', '94': '매수호가직전대비4',
            '45': '매도호가5', '65': '매도호가수량5', '85': '매도호가직전대비5', '55': '매수호가5', '75': '매수호가수량5', '95': '매수호가직전대비5',
            '46': '매도호가6', '66': '매도호가수량6', '86': '매도호가직전대비6', '56': '매수호가6', '76': '매수호가수량6', '96': '매수호가직전대비6',
            '47': '매도호가7', '67': '매도호가수량7', '87': '매도호가직전대비7', '57': '매수호가7', '77': '매수호가수량7', '97': '매수호가직전대비7',
            '48': '매도호가8', '68': '매도호가수량8', '88': '매도호가직전대비8', '58': '매수호가8', '78': '매수호가수량8', '98': '매수호가직전대비8',
            '49': '매도호가9', '69': '매도호가수량9', '89': '매도호가직전대비9', '59': '매수호가9', '79': '매수호가수량9', '99': '매수호가직전대비9',
            '50': '매도호가10', '70': '매도호가수량10', '90': '매도호가직전대비10', '60': '매수호가10', '80': '매수호가수량10', '100': '매수호가직전대비10',
            '121': '매도호가총잔량', '122': '매도호가총잔량직전대비', '125': '매수호가총잔량', '126': '매수호가총잔량직전대비',
            '23': '예상체결가', '24': '예상체결수량',
            '128': '순매수잔량', '129': '매수비율', '138': '순매도잔량', '139': '매도비율',
            '200': '예상체결가전일종가대비', '201': '예상체결가전일종가대비등락율', '238': '예상체결가전일종가대비기호',
            '291': '예상체결가장전', '292': '예상체결량장전',
            '293': '예상체결가전일대비기호장전', '294': '예상체결가전일대비장전', '295': '예상체결가전일대비등락율장전',
            '621': 'LP매도호가수량1', '631': 'LP매수호가수량1', '622': 'LP매도호가수량2', '632': 'LP매수호가수량2',
            '623': 'LP매도호가수량3', '633': 'LP매수호가수량3', '624': 'LP매도호가수량4', '634': 'LP매수호가수량4',
            '625': 'LP매도호가수량5', '635': 'LP매수호가수량5', '626': 'LP매도호가수량6', '636': 'LP매수호가수량6',
            '627': 'LP매도호가수량7', '637': 'LP매수호가수량7', '628': 'LP매도호가수량8', '638': 'LP매수호가수량8',
            '629': 'LP매도호가수량9', '639': 'LP매수호가수량9', '630': 'LP매도호가수량10', '640': 'LP매수호가수량10',
            '13': '누적거래량', '299': '전일거래량대비예상체결율',
            '215': '장운영구분', '216': '투자자별ticker',
            '6044': 'KRX매도호가잔량1', '6045': 'KRX매도호가잔량2', '6046': 'KRX매도호가잔량3', '6047': 'KRX매도호가잔량4',
            '6048': 'KRX매도호가잔량5', '6049': 'KRX매도호가잔량6', '6050': 'KRX매도호가잔량7', '6051': 'KRX매도호가잔량8',
            '6052': 'KRX매도호가잔량9', '6053': 'KRX매도호가잔량10',
            '6054': 'KRX매수호가잔량1', '6055': 'KRX매수호가잔량2', '6056': 'KRX매수호가잔량3', '6057': 'KRX매수호가잔량4',
            '6058': 'KRX매수호가잔량5', '6059': 'KRX매수호가잔량6', '6060': 'KRX매수호가잔량7', '6061': 'KRX매수호가잔량8',
            '6062': 'KRX매수호가잔량9', '6063': 'KRX매수호가잔량10',
            '6064': 'KRX매도호가총잔량', '6065': 'KRX매수호가총잔량',
            '6066': 'NXT매도호가잔량1', '6067': 'NXT매도호가잔량2', '6068': 'NXT매도호가잔량3', '6069': 'NXT매도호가잔량4',
            '6070': 'NXT매도호가잔량5', '6071': 'NXT매도호가잔량6', '6072': 'NXT매도호가잔량7', '6073': 'NXT매도호가잔량8',
            '6074': 'NXT매도호가잔량9', '6075': 'NXT매도호가잔량10',
            '6076': 'NXT매수호가잔량1', '6077': 'NXT매수호가잔량2', '6078': 'NXT매수호가잔량3', '6079': 'NXT매수호가잔량4',
            '6080': 'NXT매수호가잔량5', '6081': 'NXT매수호가잔량6', '6082': 'NXT매수호가잔량7', '6083': 'NXT매수호가잔량8',
            '6084': 'NXT매수호가잔량9', '6085': 'NXT매수호가잔량10',
            '6086': 'NXT매도호가총잔량', '6087': 'NXT매수호가총잔량',
            '6100': 'KRX중간가매도총잔량증감', '6101': 'KRX중간가매도총잔량', '6102': 'KRX중간가',
            '6103': 'KRX중간가매수총잔량', '6104': 'KRX중간가매수총잔량증감',
            '6105': 'NXT중간가매도총잔량증감', '6106': 'NXT중간가매도총잔량', '6107': 'NXT중간가',
            '6108': 'NXT중간가매수총잔량', '6109': 'NXT중간가매수총잔량증감',
            '6110': 'KRX중간가대비', '6111': 'KRX중간가대비기호', '6112': 'KRX중간가대비등락율',
            '6113': 'NXT중간가대비', '6114': 'NXT중간가대비기호', '6115': 'NXT중간가대비등락율'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_장시작시간_0s:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '215': '장운영구분', '20': '체결시간', '214': '장시작예상잔여시간'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}
        self.dic_장운영구분 = {
            '0': 'KRX장전', '3': 'KRX장시작',
            'P': 'NXT프리마켓개시', 'Q': 'NXT프리마켓종료',
            'R': 'NXT메인마켓개시', 'S': 'NXT메인마켓종료',
            'T': 'NXT애프터마켓단일가개시', 'U': 'NXT애프터마켓개시',
            'V': 'NXT종가매매종료', 'W': 'NXT애프터마켓종료'
        }


# noinspection SpellCheckingInspection,PyPep8Naming,NonAsciiCharacters
class fid_VI발동해제_1h:
    def __init__(self):
        """ fid 코드 변환용 dic 정의 """
        self.dic_코드2이름 = {
            '9001': '종목코드', '302': '종목명', '13': '누적거래량', '14': '누적거래대금',
            '9068': 'VI발동구분', '9008': '코스피코스닥전체구분', '9075': '장전구분',
            '1221': 'VI발동가격', '1223': '매매체결처리시각', '1224': 'VI해제시각', '1225': 'VI적용구분',
            '1236': '기준가격정적', '1237': '기준가격동적', '1238': '괴리율정적', '1239': '괴리율동적',
            '1489': 'VI발동가등락율', '1490': 'VI발동횟수', '9069': '발동방향구분',
            '1279': 'ExtraItem'
        }
        self.dic_이름2코드 = {value: key for key, value in self.dic_코드2이름.items()}
